# **Pandas**
## Raggruppamento

In [1]:
# import librerie
import pandas as pd

In [2]:
# definizione DataSet
df = pd.DataFrame({
    "nome":["Mark","Andrea","Luca","Alex","Jack","Max","Lou","Kim","Frank","Sam","Paul"],
    "livello":["5","6","4","4","5","6","3","5","4","6","6"],
    "zona":["Sud","Nord","Sud","Nord","Sud","Sud","Centro","Centro","Nord","Sud","Centro"],
    "incassi":[50000,52000,90000,34000,42000,72000,49000,55000,67000,65000,67000],
    "spese":[42000,43000,50000,44000,38000,39000,42000,60000,39000,44000,45000]
})

df

      nome livello    zona  incassi  spese
0     Mark       5     Sud    50000  42000
1   Andrea       6    Nord    52000  43000
2     Luca       4     Sud    90000  50000
3     Alex       4    Nord    34000  44000
4     Jack       5     Sud    42000  38000
5      Max       6     Sud    72000  39000
6      Lou       3  Centro    49000  42000
7      Kim       5  Centro    55000  60000
8    Frank       4    Nord    67000  39000
9      Sam       6     Sud    65000  44000
10    Paul       6  Centro    67000  45000

In [3]:
# visualizzazione gruppi in base a zona
df.groupby('zona').groups

{'Centro': [6, 7, 10], 'Nord': [1, 3, 8], 'Sud': [0, 2, 4, 5, 9]}

In [4]:
# visualizzazione gruppi in base a zona e al livello
df.groupby(['zona','livello']).groups

{('Centro', '3'): [6], ('Centro', '5'): [7], ('Centro', '6'): [10], ('Nord', '4'): [3, 8], ('Nord', '6'): [1], ('Sud', '4'): [2], ('Sud', '5'): [0, 4], ('Sud', '6'): [5, 9]}

In [5]:
# visualizzazione gruppo in base a valore
df.groupby('zona').get_group('Centro')

    nome livello    zona  incassi  spese
6    Lou       3  Centro    49000  42000
7    Kim       5  Centro    55000  60000
10  Paul       6  Centro    67000  45000

In [7]:
# visualizzazione media dei valori in base al gruppo zona
df.groupby('zona').mean(numeric_only=True)

        incassi    spese
zona
Centro  57000.0  49000.0
Nord    51000.0  42000.0
Sud     63800.0  42600.0

In [9]:
# visualizzazione media dei valori ordinati in base agli incassi decrescenti
df.groupby('zona').mean(numeric_only=True).sort_values('incassi', ascending=False)

        incassi    spese
zona
Sud     63800.0  42600.0
Centro  57000.0  49000.0
Nord    51000.0  42000.0

In [10]:
# visualizzazione somma dei valori in base al gruppo zona
df.groupby('zona').sum()

                      nome livello  incassi   spese
zona
Centro          LouKimPaul     356   171000  147000
Nord       AndreaAlexFrank     644   153000  126000
Sud     MarkLucaJackMaxSam   54566   319000  213000

In [11]:
# visualizzazione somma dei valori ordinati in base agli incassi decrescenti
df.groupby('zona').sum().sort_values('incassi', ascending=False)

                      nome livello  incassi   spese
zona
Sud     MarkLucaJackMaxSam   54566   319000  213000
Centro          LouKimPaul     356   171000  147000
Nord       AndreaAlexFrank     644   153000  126000

In [12]:
# operazioni tra raggruppamenti
df.groupby('zona').sum()['incassi'] - df.groupby('zona').sum()['spese']

zona
Centro     24000
Nord       27000
Sud       106000
dtype: int64

In [15]:
# visualizzazione valore mediano in base al gruppo zona
df.groupby('zona').median(numeric_only=True)

        incassi    spese
zona
Centro  55000.0  45000.0
Nord    52000.0  43000.0
Sud     65000.0  42000.0

In [16]:
# visualizzazione tabellare aggregazioni
pd.pivot_table(df, values=['spese', 'incassi'], index=['zona', 'nome'])

               incassi    spese
zona   nome
Centro Kim     55000.0  60000.0
       Lou     49000.0  42000.0
       Paul    67000.0  45000.0
Nord   Alex    34000.0  44000.0
       Andrea  52000.0  43000.0
       Frank   67000.0  39000.0
Sud    Jack    42000.0  38000.0
       Luca    90000.0  50000.0
       Mark    50000.0  42000.0
       Max     72000.0  39000.0
       Sam     65000.0  44000.0